updated architecture diagrams
